Revit 2024 API
AreaTag.Area Property
The area that the tag is associated with.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public Area Area { get; }
Visual Basic
Public ReadOnly Property Area As Area
	Get
Visual C++
public:
property Area^ Area {
	Area^ get ();
}
Remarks
In rare cases, the tag may not be associated to an area. The property will be null in these situations.
See Also
AreaTag Class
Autodesk.Revit.DB Namespace